## EDGE GEOCODE 2017-2018 Modeled

In [1]:
dataset_id = "edge_1718_modeled"

In [2]:
!bq --location=US mk --dataset {dataset_id}

Dataset 'sashimi-266523:edge_1718_modeled' successfully created.

#### Create postsecondary_school table with necessary columns

In [7]:
%%bigquery
create or replace table edge_1718_modeled.postsecondary_school as
select UNITID as SCHOOLID, NAME, STREET, CITY, STATE, ZIP as ZIPCODE, cast(LAT as FLOAT64) as LATITUDE, cast(LON as FLOAT64) as LONGITUDE
from edge_1718_staging.postsecondary_school
order by ZIPCODE

Empty DataFrame
Columns: []
Index: []

##### Check table

In [29]:
%%bigquery
select *
from edge_1718_modeled.postsecondary_school
limit 10

,SCHOOLID,NAME,STREET,CITY,STATE,ZIPCODE,LATITUDE,LONGITUDE
0,445498,Colegio Tecnico de Electricidad Galloza,Carr 4416 Km 2.5 Int. Bo Laguna,Aguada,PR,00602,18.352602,-67.177147
1,446516,Rosslyn Training Academy of Cosmetology,Calle Paz 213,Aguada,PR,00602,18.379277,-67.187941
2,418755,Colegio Tecnologico y Comercial de Puerto Rico,Calle Paz 165 Altos,Aguada,PR,00602-0960,18.378655,-67.184110
3,242626,Inter American University of Puerto Rico-Aguad...,"Carr. 459 Int. 463, Barrio Corrales Sector Calero",Aguadilla,PR,00603,18.467886,-67.121671
4,376385,Universal Technology College of Puerto Rico,111 Comercio St,Aguadilla,PR,00603,18.428120,-67.155628
5,443951,Charlie's Guard-Detective Bureau and Academy Inc,Road 107 Km 3.1 Bo. Borinquen,Aguadilla,PR,00603,18.469662,-67.153612
6,445984,Xtreme Career Institute,Calle Jose De jesus Esteves #7,Aguadilla,PR,00603,18.433052,-67.154452
7,243106,University of Puerto Rico-Aguadilla,Belt St. Ramey Base,Aguadilla,PR,00604-6150,18.498652,-67.137930
8,418782,Automeca Technical College-Aguadilla,Parque Industrial La Montana Km09 Edif932,Aguadilla,PR,00605,18.448502,-67.141800
9,242954,Modern Hairstyling Institute-Arecibo,Vista Azul Shopping Center #2 Km.80.0,Arecibo,PR,00612,18.475820,-66.754059

##### Check for primary key

In [13]:
%%bigquery
select count(SCHOOLID)
from edge_1718_modeled.postsecondary_school

    f0_
0  7599

In [14]:
%%bigquery
select count(distinct SCHOOLID)
from edge_1718_modeled.postsecondary_school

    f0_
0  7599

In [16]:
%%bigquery
select count(ZIPCODE)
from edge_1718_modeled.postsecondary_school

    f0_
0  7599

In [17]:
%%bigquery
select count(distinct ZIPCODE)
from edge_1718_modeled.postsecondary_school

    f0_
0  6537

#### Create public_school table with necessary columns

In [6]:
%%bigquery
create or replace table edge_1718_modeled.public_school as
select NCESSCH as SCHOOLID, NAME, STREET, CITY, STATE, ZIP as ZIPCODE, cast(LAT as FLOAT64) as LATITUDE, cast(LON as FLOAT64) as LONGITUDE
from edge_1718_staging.public_school
order by ZIPCODE

Empty DataFrame
Columns: []
Index: []

##### Check table

In [30]:
%%bigquery
select *
from edge_1718_modeled.public_school
limit 10

,SCHOOLID,NAME,STREET,CITY,STATE,ZIPCODE,LATITUDE,LONGITUDE
0,720003000507,DOMINGO PIETRI RUIZ,16 CALLE RODULFO GONZALEZ,ADJUNTAS,PR,00601,18.173030,-66.726662
1,720003001132,RAFAEL APARICIO JIMENEZ,CALLE RODULFO GONZALEZ FINAL,ADJUNTAS,PR,00601,18.164856,-66.723917
2,720003001138,ANGEL A. MALDONADO BULA,CARR 526 KM 7 HM 2 BO TANAMA SECTOR EL VALLE,ADJUNTAS,PR,00601,18.216899,-66.761178
3,720003001145,DOMINGO MASSOL,CARR 388 KM 0 HM 1 BO VACAS SALTILLO,ADJUNTAS,PR,00601,18.134163,-66.729557
4,720003001147,TELESFORO VELEZ OLIVER,CARR 521 KM 5 HM 6 BO VEGAS ARRIBA,ADJUNTAS,PR,00601,18.168130,-66.692534
5,720003001151,HECTOR I. RIVERA,CARR 135 KM 75 HM 5 BO YAHUECAS,ADJUNTAS,PR,00601,18.197394,-66.793426
6,720003000551,PROFESORA JUANA ROSARIO CARRERO (ESCUELA INTER...,AVE. NATIVO ALERS DESVIO SUR,AGUADA,PR,00602,18.376094,-67.185025
7,720003000751,ZOILO CAJIGAS SOTOMAYOR,CALLE D GONZALEZ URB MONTEMAR,AGUADA,PR,00602,18.382801,-67.189234
8,720003000752,ARSENIO MARTINEZ,CARR115 CALLE COLON,AGUADA,PR,00602,18.381468,-67.192866
9,720003000753,DR. CARLOS GONZALEZ,CARR 441 KM 0 HM 1 BO GUANIQUILLA,AGUADA,PR,00602,18.390776,-67.194982

##### Check for primary key

In [18]:
%%bigquery
select count(SCHOOLID)
from edge_1718_modeled.public_school

      f0_
0  102337

In [19]:
%%bigquery
select count(distinct SCHOOLID)
from edge_1718_modeled.public_school

      f0_
0  102337

In [20]:
%%bigquery
select count(ZIPCODE)
from edge_1718_modeled.public_school

      f0_
0  102337

In [21]:
%%bigquery
select count(distinct ZIPCODE)
from edge_1718_modeled.public_school

     f0_
0  22621

#### Create private_school table with necessary columns

In [12]:
%%bigquery
create or replace table edge_1718_modeled.private_school as
select PPIN as SCHOOLID, PINST as NAME, STREET, CITY, STATE, ZIP as ZIPCODE, cast(LAT as FLOAT64) as LATITUDE, cast(LON as FLOAT64) as LONGITUDE
from edge_1718_staging.private_school
order by ZIPCODE

Empty DataFrame
Columns: []
Index: []

##### Check table

In [31]:
%%bigquery
select *
from edge_1718_modeled.private_school
limit 10

,SCHOOLID,NAME,STREET,CITY,STATE,ZIPCODE,LATITUDE,LONGITUDE
0,00603188,THE COMMON SCHOOL,521 S PLEASANT,AMHERST,MA,01002,42.360104,-72.520857
1,A9502182,AMHERST MONTESSORI SCHOOL,27 POMEROY LN,AMHERST,MA,01002,42.338990,-72.518301
2,00602209,POPE FRANCIS HIGH SCHOOL,134 SPRINGFIELD ST,CHICOPEE,MA,01013,42.145872,-72.604592
3,00602311,ST STANISLAUS ELEMENTARY SCHOOL,534 FRONT ST,CHICOPEE,MA,01013,42.147620,-72.596561
4,A0301832,VALLEY WEST SCHOOL,269 MOORE ST,CHICOPEE,MA,01013,42.137104,-72.591826
5,00602399,ST JOAN OF ARC SCHOOL,587 GRATTAN ST,CHICOPEE,MA,01020,42.170763,-72.597507
6,00604341,THE WILLISTON NORTHAMPTON SCHOOL,19 PAYSON AVE,EASTHAMPTON,MA,01027,42.266660,-72.671791
7,A9303204,TRI-COUNTY SCHOOLS,201 E ST,EASTHAMPTON,MA,01027,42.279200,-72.639900
8,00603949,THE MACDUFFIE SCHOOL,66 SCHOOL ST,GRANBY,MA,01033,42.269020,-72.473921
9,A1301637,COMMUNITY CHRISTIAN SCHOOL,409 MAIN RD,GRANVILLE,MA,01034,42.066194,-72.854588

##### Check for primary key

In [22]:
%%bigquery
select count(SCHOOLID)
from edge_1718_modeled.private_school

     f0_
0  22890

In [23]:
%%bigquery
select count(distinct SCHOOLID)
from edge_1718_modeled.private_school

     f0_
0  22890

In [26]:
%%bigquery
select count(ZIPCODE)
from edge_1718_modeled.private_school

     f0_
0  22890

In [27]:
%%bigquery
select count(distinct ZIPCODE)
from edge_1718_modeled.private_school

    f0_
0  9809